app/Http/Controllers/Home/ReplyController.php

select * from `tests` where `tests`.`user_id` = 1 and `tests`.`user_id` is not null
---
    public function index()
    {
        $user    = Auth::user();
        $tests   = $user->tests()->get();

select * from `options` where `options`.`question_id` in (1, 2)
select * from `questions` where `test_id` = '1'
select * from `tests` where `tests`.`id` in (1)
---
    public function create(Request $request)
    {

        $test_id = $request->id;
        $questions = Question::where('test_id', $test_id)
            ->with(['options', 'tests'])
            ->get();