app/Http/Controllers/Admin/TestController.php

    public function index()
    {
        $users_query = Test::query();
        if ($keyword = request('search')) {
            $users_query
            ->where('name', 'LIKE', "%{$keyword}%")
            ->orWhere('family','LIKE', "%{$keyword}%");
        }
        $tests=  $users_query->paginate(15);
---
select * from `tests` limit 15 offset 0
select count(*) as aggregate from `tests`