app/Http/Controllers/Admin/UserController.php

select * from `users` limit 15 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users_query = User::query();
        if ($keyword = request('search')) {
            $users_query
            ->where('name', 'LIKE', "%{$keyword}%")
            ->orWhere('family','LIKE', "%{$keyword}%");
        }


       $users=  $users_query->paginate(15);